In [132]:
import numpy as np

In [133]:
import pandas as pd

In [134]:
data = pd.Series([1, 2, 3, 4, 5])

In [135]:
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [136]:
data.values

array([1, 2, 3, 4, 5])

In [137]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [138]:
data[0]

1

In [139]:
data[1:3]

1    2
2    3
dtype: int64

In [140]:
data = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])

In [141]:
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [142]:
data['c']

3

In [143]:
data = pd.Series(dict(a=1, b=2, c=3, d=4, e=5))

In [144]:
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [145]:
series_1 = pd.Series(dict(a=1, b=2, c=3, d=4, e=5))

In [146]:
series_2 = pd.Series(dict(a=11, b=12, c=13, d=14, e=15))

In [147]:
df = pd.DataFrame({'columns_1':series_1, 'columns_2':series_2})

In [148]:
df

   columns_1  columns_2
a          1         11
b          2         12
c          3         13
d          4         14
e          5         15

In [149]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [150]:
df.columns

Index(['columns_1', 'columns_2'], dtype='object')

In [151]:
df['columns_1']

a    1
b    2
c    3
d    4
e    5
Name: columns_1, dtype: int64

In [152]:
df['columns_1']['a']

1

In [153]:
df['columns_2']['c']

13

In [154]:
df2 = pd.DataFrame([[1,2],[11,12],[21,22]], index=['a', 'b', 'c'], columns=['col_1', 'col_2'])

In [155]:
df2

   col_1  col_2
a      1      2
b     11     12
c     21     22

In [156]:
df3 = pd.DataFrame([[1,2,3],[11,12,13]], index=['a', 'b'], columns=['col_1', 'col_2', 'col_3'])

In [157]:
df3

   col_1  col_2  col_3
a      1      2      3
b     11     12     13

In [158]:
df.at['a', 'columns_1']

1

In [159]:
df.at['b', 'columns_2'] = 100

In [160]:
df

   columns_1  columns_2
a          1         11
b          2        100
c          3         13
d          4         14
e          5         15

In [161]:
df.iat[2,0]

3

In [162]:
df.iat[3,1] = 1000

In [163]:
df

   columns_1  columns_2
a          1         11
b          2        100
c          3         13
d          4       1000
e          5         15

In [164]:
df.loc['b':'d', 'columns_1']

b    2
c    3
d    4
Name: columns_1, dtype: int64

In [165]:
df.loc['d':'e', 'columns_1':'columns_2'] = [[0.1,0.2],[0.3,0.4]]

In [166]:
df

   columns_1  columns_2
a        1.0       11.0
b        2.0      100.0
c        3.0       13.0
d        0.1        0.2
e        0.3        0.4

In [167]:
df.iloc[[1,3],[0,1]]

   columns_1  columns_2
b        2.0      100.0
d        0.1        0.2

In [168]:
df.iloc[[2,4],[0,1]] = [[1001,1002],[1003,1004]]

In [169]:
df.at['a','columns_1'] = 3.1
df.at['a','columns_2'] = 1.4
df.at['b','columns_1'] = 2.2
df.at['b','columns_2'] = 6.8

In [170]:
df

   columns_1  columns_2
a        3.1        1.4
b        2.2        6.8
c     1001.0     1002.0
d        0.1        0.2
e     1003.0     1004.0

In [171]:
df.to_csv('df_data.csv')

In [172]:
df2.to_excel('df2_data.xlsx')

In [173]:
df3 = pd.read_csv('df_data.csv')

In [174]:
df4 = pd.read_excel('df2_data.xlsx')

In [175]:
df3

  Unnamed: 0  columns_1  columns_2
0          a        3.1        1.4
1          b        2.2        6.8
2          c     1001.0     1002.0
3          d        0.1        0.2
4          e     1003.0     1004.0

In [176]:
df4

  Unnamed: 0  col_1  col_2
0          a      1      2
1          b     11     12
2          c     21     22

In [178]:
df_sheet_index = pd.read_excel('df2_data.xlsx', sheet_name=0, index_col=0)

In [179]:
df_sheet_index

   col_1  col_2
a      1      2
b     11     12
c     21     22